content/computer/learn-python-the-hard-way.md
+++
title = "learn python the hard way"
author = ["Eason Zhang"]
summary = "notes of /learn python3 the hard way/"
date = 2018-05-27T20:43:00+08:00
lastmod = 2018-05-27T20:49:00+08:00
tags = ["computer", "python"]
draft = false
+++

<style>
  .ox-hugo-toc ul {
    list-style: none;
  }
</style>
<div class="ox-hugo-toc toc">
<div></div>

## Table of Contents

- <span class="section-num">1</span> [a small surprise in ex4.py](#a-small-surprise-in-ex4-dot-py)
- <span class="section-num">2</span> [imcompatiblility  between python 3.5 and 3.6](#imcompatiblility-between-python-3-dot-5-and-3-dot-6)
- <span class="section-num">3</span> [default end is enter](#default-end-is-enter)
- <span class="section-num">4</span> [the multiline string](#the-multiline-string)
- <span class="section-num">5</span> [help in Ipython](#help-in-ipython)
- <span class="section-num">6</span> [call a script with more inputs](#call-a-script-with-more-inputs)
- <span class="section-num">7</span> [open a file](#open-a-file)
- <span class="section-num">8</span> [call function recursively](#call-function-recursively)
- <span class="section-num">9</span> [the input of a function](#the-input-of-a-function)
- <span class="section-num">10</span> [variable in the for loop](#variable-in-the-for-loop)
- <span class="section-num">11</span> [the `range` function](#the-range-function)
- <span class="section-num">12</span> [variable in the for loop and range](#variable-in-the-for-loop-and-range)
- <span class="section-num">13</span> [a project skeleton](#a-project-skeleton)

</div>
<!--endtoc-->

For a long time, I have been planning to learn Python. However, because I never
use Python in my work, the plan was delayed again and again. Today, it is
raining cats and dogs outside. Why not do something I have planned long time ago
in this perfect mode? So I picked up the book _Learning Python the Hard Way_ by
Zed Shaw. During the learning, I use Emacs as my Editor, running the programming
on my old Thinkpad with Ubuntu 16.04 and Python3.5. I am going to learn Python
in the hard way. However, I believe it will be the clever and efficient way.


## <span class="section-num">1</span> a small surprise in ex4.py {#a-small-surprise-in-ex4-dot-py}

Everything goes fine until I am doing exercise 4. The python code is:

{{< highlight python "linenos=table, linenostart=1" >}}
cars = 100
space_in_a_car = 4
drivers = 30
passengers = 90
cars_not_driven = cars - drivers
cars_driven = drivers
carpool_capacity = cars_driven * space_in_a_car
average_passengers_per_car = passengers / cars_driven

print("There are",cars,"cars available.")
print("There are only",drivers,"drivers avaiable.")
print("There will be", cars_not_driven,"empty cars today.")
print("We can transport",carpool_capacity,"people today.")
print("We have",passengers,"to carpool today.")
print("We need to put ablout",average_passengers_per_car,"in each car")
{{< /highlight >}}

```text
There are 100 cars available.
There are only 30 drivers avaiable.
There will be 70 empty cars today.
We can transport 120 people today.
We have 90 to carpool today.
We need to put ablout 3.0 in each car
```

and the result is shown belowing the code.

Notice that in the source, the first line concerning print is:

```python
print("There are",cars,"cars available.")
```

instead of

```python
print("There are ",cars," cars available.")
```

Notice the difference? the whitespace. In Python, the whitespace is inserted
around the results automatically which is kind of a surprise for a programmer
familiar with `C/C++` .


## <span class="section-num">2</span> imcompatiblility  between python 3.5 and 3.6 {#imcompatiblility-between-python-3-dot-5-and-3-dot-6}



I have python3.5 installed on my Ubuntu 16.04 hoping it will help me go through
the book _Learning Python the Hard Way_ . However, when it comes to ex5.py, the
dream is waken up.

{{< highlight python "linenos=table, linenostart=1" >}}
my_name = 'Zed A. Shaw'
my_age = 35
my_height = 74
my_weight = 180
my_eyes = 'Blue'
my_teeth = 'White'
my_hair = 'Brown'

print(f"Let's talk about {my_name}.")
print(f"He's {my_height} inches tall.")
print(f"He's {my_weight} pounds heavy.")
print("Actually that's not too heavy.")
print(f"He's got {my_eyes} eyes and {my_hair} hair.")
print(f"His teeth are usually {my_teeth} depending on the coffee.")

# this line is tricky, try to get it exact right
total = my_age + my_height + my_weight
print(f"If I add {my_age}, {my_height}, and {my_weight} I get {total}.")
{{< /highlight >}}

When I execute `python3.5 ex5.py` in terminal. SyntaxError is triggered and it
says:

```text
  File "ex5.py", line 9
    print(f"Let's talk about {my_name}.")
                                       ^
SyntaxError: invalid syntax
```

After carefully comparison with the code in the book, I found no mistakes. So
maybe it is the interpreter that raise the error. So python 3.6 is installed.

```shell
sudo add-apt-repository ppa:jonathonf/python-3.6
sudo apt-get update
sudo apt-get install python3.6
```

Then I execute `python3.6 ex5.py`, hooray, it works with output:

```text
Let's talk about Zed A. Shaw.
He's 74 inches tall.
He's 180 pounds heavy.
Actually that's not too heavy.
He's got Blue eyes and Brown hair.
His teeth are usually White depending on the coffee.
If I add 35, 74, and 180 I get 289.
```

After this, I began to worry python for its incompatibility even after python3.
Even this little `print` function shows difference, what about other features?


## <span class="section-num">3</span> default end is enter {#default-end-is-enter}



In ex7.py

```python
print("Mary had a little lamb.")
print("Its fleece was white as {}.".format('snow'))
print("And everywhere that Mary went.")
print("."*10)

end1 = "C"
end2 = "h"
end3 = "e"
end4 = "e"
end5 = "s"
end6 = "e"
end7 = "B"
end8 = "u"
end9 = "r"
end10 = "g"
end11 = "e"
end12 = "r"
# watch end = '' at the end. try removing it to see what happens
print(end1 + end2 + end3 + end4 + end5 + end6 , end=' ')
print(end7 + end8 + end9 + end10 + end11 + end12)
```

The output is:

```text
Mary had a little lamb.
Its fleece was white as snow.
And everywhere that Mary went.
..........
Cheese Burger
```

Notice the line:

```python
print(end1 + end2 + end3 + end4 + end5 + end6 , end=' ')
```

This line change the default `end` as whitespace. By default, the `end` will be
`enter`


## <span class="section-num">4</span> the multiline string {#the-multiline-string}



There are two ways to generate multiline string. first is using the escape
sequence; second is to use three double-quotes pair. Today, I found that three
single-quotes pair is also ok. see the example below.

```python
fat_cat ='''
I'll do a list:
\t* Cat food
\t* Fishies
\t* Catnip\n\t* Grass
'''

thin_mouse ='''
I'll do another list:
\t* mouse food
\t* Rice
\t* Catnip\n\t* Grass
'''
print(fat_cat)
print(thin_mouse)
```

also don't foget that the string can be format by prefix a `f` to be a f-string.


## <span class="section-num">5</span> help in Ipython {#help-in-ipython}



I like Ipython because of its REPL style. To get help of a function just follow
the function with a ? or ??, then hit the return.

For example, I want to read the help for the builtin function `input`

```text
In [1]: input?
Type:        builtin_function_or_method
String form: <built-in function input>
Namespace:   Python builtin
Definition:  input(prompt)
Docstring:
Read a string from standard input.  The trailing newline is stripped.

The prompt string, if given, is printed to standard output without a
trailing newline before reading input.

If the user hits EOF (*nix: Ctrl-D, Windows: Ctrl-Z+Return), raise EOFError.
On *nix systems, readline is used if available.
```

Maybe, ? and ?? will be the most frequenct symbol I use during using python.
