content_org/computer.org
*** call a script with more inputs
[2018-05-05 Sat 22:30]

You can call a script with more inputs using the =argv= module
    #+begin_src python
from sys import argv
# read the WYSS section for how to run this
script, first, second ,third = argv

print("The script is called:",script)
print("Your first variable is:",first)
print("Your second variable is:",second)
print("Your third variable is:",third)
    #+end_src

when save the above code as ex13.py, then call it from the shell:
#+begin_example
python3.6 ex13.py 1st 2nd 3rd
#+end_example

Then the =argv= will contains the =ex13.py= =1st= =2nd= =3rd= . The first line
of the code:
    #+begin_src python
script, first, second, third = argv
    #+end_src
unpack the =argv= . Then, =script ='ex13.py'=  =first = '1st'=  =second = '2nd'=
and so on.

Another way allowing the user to input is using the function =input= .
*** open a file
[2018-05-06 Sun 08:24]

    #+begin_src python
txt = open(filename)
    #+end_src

The =txt= is not the contents of the file. It is a file object. By this object,
you can move around and read the file. Actually, we can open the file twice and
use two different file objects pointing to the same file.


A file opject also has the following function:
#+CAPTION: functions that a file object can call
#+NAME: tab:20180506functionsatablecall
#+ATTR_HTML: :border 1 :rules all :frame border :align center
#+ATTR_LATEX: :align center
|----------------+-----------------------------------------------------------|
| name           | description                                               |
|----------------+-----------------------------------------------------------|
| close          | close the file                                            |
| read           | read the contents of the file                             |
| readline       | reads just one line of a text file                        |
| truncate       | empties the file                                          |
| write('stuff') | writes "stuff" into the file                              |
| seek(0)        | move the read/write location to the beginning of the file |
|----------------+-----------------------------------------------------------|

By default, the file is opened for reading. If you want to open a file and
writing something into it, use:
    #+begin_src python
txt = open(filename,'w')
    #+end_src

If you want to open a file, read the contents, then write something into it.
    #+begin_src python
txt = open(filename,'r+')
    #+end_src

Actually, there is another option for reading and writing =w+=, and the
difference is :
1. =r+= Open for reading and writing.  The stream is positioned at the beginning
   of the file.
2. =w+= Open for reading and writing.  The file is created if it does not exist,
   otherwise it is truncated.  The stream is positioned at the beginning of the
   file.

Notice that the =w+= option will truncate the file if it exists. Also, the =w=
option will truncate the file if exists. So the =target.truncate()= is not
necessary if you open a file with =w= or =w+= .

On =close= your file, you will find that most of the time it is ok not close it
because Cpython will do it for you. However, when you forget to close the file,
the contents aimed to be written into the file is actually stored in a buffer.
until you close the file, the contents will not be saved to the file.
*** call function recursively
[2018-05-06 Sun 12:01]

Look at the code below:
    #+begin_src python
# this one is like your scripts with argv
def print_two(*args):
    arg1,arg2,arg3 = args
    print(f"arg1: {arg1},arg2: {arg2}, arg3: {arg3}")
    print_none()
# ok, that *args is actually pointless, we can just do this
def print_two_again(arg1,arg2):
    print(f"arg1: {arg1},arg2: {arg2}")

# this just takes one argument
def print_one(arg1):
    print(f"arg1: {arg1}")

# this one takes no arguments
def print_none():
    print("I got nothin'.")
    print_two("Zhang","Chao","long")

print_two_again("Zed","Shaw")
print_one("First!")
print_none()
    #+end_src

Notice that =print_two= calls =print_none= and vice versa. This will raise the
RecursionError :
#+begin_example
RecursionError: maximum recursion depth exceeded while calling a Python object
#+end_example

I am just curious what will happen if I let two functions call each other
recursively. :)
*** the input of a function
[2018-05-06 Sun 14:33]

Input to a function is just like =argv= to a script. I found that duirng the
input of a function can also be a function:
    #+begin_src python
print("input the argument:")
cheese_and_crackers(input("arg1:"),input("arg2:"))
    #+end_src

Drill more on the =input("arg1:")= , I found that the return of =input("arg1:")=
is a str, so there must be an automatic convert from str to int for the
=cheese_and_crackers= .

    #+begin_src python
cheese_and_crackers(input("arg1:")+10,input("arg2:"))
    #+end_src

will raise a TypeError. So:
    #+begin_src python
cheese_and_crackers(int(input("arg1:"))+10,input("arg2:"))
    #+end_src

will work as I wish. Furthermore, maybe the =int= should be =float= to accept
float number.
*** variable in the for loop
[2018-05-19 Sat 19:43]

In a =for= loop, python can use a variable that isn't defined yet. This is because
that the =for= loop defines the variable and initialize it to the current
element of the loop iteration each time through.

Now, we give an example:
    #+begin_src python -n
# we can also build lists, first start with an empty one
# you have to define this variable before you use it.
elements = []

# then use the range function to do 0 to 5 counts
for i in range(4,100,16):
    # you don't have to define i before you use it.
    print(f"Adding {i} to the list.")
    # append is a function that lists understand
    elements.append(i)


i = 20
print(f"i is {i}")
# now we can print them out too
for i in elements:
    #even you define i = 6, i will be overwritten in the for statement
    print(f"Element was: {i}")

print(f"i is {i}")
    #+end_src

At first, we define an empty list =elements= , then we fill the list with
=range(3,100,16)= . After that we print the elements of the list. Notice that
even we define a variable =i=20= , the statement =for i in elements:= will
define a new variable =i= and overwrite the value of =20= . The value of the new
=i= is the value of the first element of the list. After each loop, the =i=
steps through the list.

The result is:
#+begin_example
Adding 4 to the list.
Adding 20 to the list.
Adding 36 to the list.
Adding 52 to the list.
Adding 68 to the list.
Adding 84 to the list.
i is 20
Element was: 4
Element was: 20
Element was: 36
Element was: 52
Element was: 68
Element was: 84
i is 84
#+end_example

Notice that before the =for= loop, =i=20= . Once the =for= loop begins, =i=
will be recreated and be asigned value =4= which is the first element of the
list. After the =for= loop, =i=84= .
*** the =range= function
[2018-05-19 Sat 20:00]

In ex32, there appears a builtin function =range=. =range= is used to generate a
sequence of integers, and its help doc is:
#+begin_example
Type:            type
String form:     <class 'range'>
Namespace:       Python builtin
Init definition: range(self, *args, **kwargs)
Docstring:
range(stop) -> range object
range(start, stop[, step]) -> range object

Return an object that produces a sequence of integers from start (inclusive)
to stop (exclusive) by step.  range(i, j) produces i, i+1, i+2, ..., j-1.
start defaults to 0, and stop is omitted!  range(4) produces 0, 1, 2, 3.
These are exactly the valid indices for a list of 4 elements.
When step is given, it specifies the increment (or decrement).
#+end_example

Notice that:
    #+begin_src python
range(start,stop,step)
    #+end_src
will generate the sequence of integers including the =start= and excluding the
=stop= . This is different from Matlab, in which =start:step:stop= will include
both the =start= and the =stop= .
