content/computer/learn-python-the-hard-way.md


## <span class="section-num">6</span> call a script with more inputs {#call-a-script-with-more-inputs}



You can call a script with more inputs using the `argv` module

```python
from sys import argv
# read the WYSS section for how to run this
script, first, second ,third = argv

print("The script is called:",script)
print("Your first variable is:",first)
print("Your second variable is:",second)
print("Your third variable is:",third)
```

when save the above code as ex13.py, then call it from the shell:

```text
python3.6 ex13.py 1st 2nd 3rd
```

Then the `argv` will contains the `ex13.py` `1st` `2nd` `3rd` . The first line
of the code:

```python
script, first, second, third = argv
```

unpack the `argv` . Then, `script ='ex13.py'`  `first = '1st'`  `second = '2nd'`
and so on.

Another way allowing the user to input is using the function `input` .


## <span class="section-num">7</span> open a file {#open-a-file}



```python
txt = open(filename)
```

The `txt` is not the contents of the file. It is a file object. By this object,
you can move around and read the file. Actually, we can open the file twice and
use two different file objects pointing to the same file.

A file opject also has the following function:

<a id="orgd804b12"></a>

<div class="table-caption">
  <span class="table-number">Table 1:</span>
  functions that a file object can call
</div>

| name           | description                                               |
|----------------|-----------------------------------------------------------|
| close          | close the file                                            |
| read           | read the contents of the file                             |
| readline       | reads just one line of a text file                        |
| truncate       | empties the file                                          |
| write('stuff') | writes "stuff" into the file                              |
| seek(0)        | move the read/write location to the beginning of the file |

By default, the file is opened for reading. If you want to open a file and
writing something into it, use:

```python
txt = open(filename,'w')
```

If you want to open a file, read the contents, then write something into it.

```python
txt = open(filename,'r+')
```

Actually, there is another option for reading and writing `w+`, and the
difference is :

1.  `r+` Open for reading and writing.  The stream is positioned at the beginning
    of the file.
2.  `w+` Open for reading and writing.  The file is created if it does not exist,
    otherwise it is truncated.  The stream is positioned at the beginning of the
    file.

Notice that the `w+` option will truncate the file if it exists. Also, the `w`
option will truncate the file if exists. So the `target.truncate()` is not
necessary if you open a file with `w` or `w+` .

On `close` your file, you will find that most of the time it is ok not close it
because Cpython will do it for you. However, when you forget to close the file,
the contents aimed to be written into the file is actually stored in a buffer.
until you close the file, the contents will not be saved to the file.


## <span class="section-num">8</span> call function recursively {#call-function-recursively}



Look at the code below:

```python
# this one is like your scripts with argv
def print_two(*args):
    arg1,arg2,arg3 = args
    print(f"arg1: {arg1},arg2: {arg2}, arg3: {arg3}")
    print_none()
# ok, that *args is actually pointless, we can just do this
def print_two_again(arg1,arg2):
    print(f"arg1: {arg1},arg2: {arg2}")

# this just takes one argument
def print_one(arg1):
    print(f"arg1: {arg1}")

# this one takes no arguments
def print_none():
    print("I got nothin'.")
    print_two("Zhang","Chao","long")

print_two_again("Zed","Shaw")
print_one("First!")
print_none()
```

Notice that `print_two` calls `print_none` and vice versa. This will raise the
RecursionError :

```text
RecursionError: maximum recursion depth exceeded while calling a Python object
```

I am just curious what will happen if I let two functions call each other
recursively. :)


## <span class="section-num">9</span> the input of a function {#the-input-of-a-function}



Input to a function is just like `argv` to a script. I found that duirng the
input of a function can also be a function:

```python
print("input the argument:")
cheese_and_crackers(input("arg1:"),input("arg2:"))
```

Drill more on the `input("arg1:")` , I found that the return of `input("arg1:")`
is a str, so there must be an automatic convert from str to int for the
`cheese_and_crackers` .

```python
cheese_and_crackers(input("arg1:")+10,input("arg2:"))
```

will raise a TypeError. So:

```python
cheese_and_crackers(int(input("arg1:"))+10,input("arg2:"))
```

will work as I wish. Furthermore, maybe the `int` should be `float` to accept
float number.


## <span class="section-num">10</span> variable in the for loop {#variable-in-the-for-loop}



In a `for` loop, python can use a variable that isn't defined yet. This is because
that the `for` loop defines the variable and initialize it to the current
element of the loop iteration each time through.

Now, we give an example:

{{< highlight python "linenos=table, linenostart=1" >}}
# we can also build lists, first start with an empty one
# you have to define this variable before you use it.
elements = []

# then use the range function to do 0 to 5 counts
for i in range(4,100,16):
    # you don't have to define i before you use it.
    print(f"Adding {i} to the list.")
    # append is a function that lists understand
    elements.append(i)


i = 20
print(f"i is {i}")
# now we can print them out too
for i in elements:
    #even you define i = 6, i will be overwritten in the for statement
    print(f"Element was: {i}")

print(f"i is {i}")
{{< /highlight >}}

At first, we define an empty list `elements` , then we fill the list with
`range(3,100,16)` . After that we print the elements of the list. Notice that
even we define a variable `i=20` , the statement `for i in elements:` will
define a new variable `i` and overwrite the value of `20` . The value of the new
`i` is the value of the first element of the list. After each loop, the `i`
steps through the list.

The result is:

```text
Adding 4 to the list.
Adding 20 to the list.
Adding 36 to the list.
Adding 52 to the list.
Adding 68 to the list.
Adding 84 to the list.
i is 20
Element was: 4
Element was: 20
Element was: 36
Element was: 52
Element was: 68
Element was: 84
i is 84
```

Notice that before the `for` loop, `i=20` . Once the `for` loop begins, `i`
will be recreated and be asigned value `4` which is the first element of the
list. After the `for` loop, `i=84` .


## <span class="section-num">11</span> the `range` function {#the-range-function}



In ex32, there appears a builtin function `range`. `range` is used to generate a
sequence of integers, and its help doc is:

```text
Type:            type
String form:     <class 'range'>
Namespace:       Python builtin
Init definition: range(self, *args, **kwargs)
Docstring:
range(stop) -> range object
range(start, stop[, step]) -> range object

Return an object that produces a sequence of integers from start (inclusive)
to stop (exclusive) by step.  range(i, j) produces i, i+1, i+2, ..., j-1.
start defaults to 0, and stop is omitted!  range(4) produces 0, 1, 2, 3.
These are exactly the valid indices for a list of 4 elements.
When step is given, it specifies the increment (or decrement).
```

Notice that:

```python
range(start,stop,step)
```

will generate the sequence of integers including the `start` and excluding the
`stop` . This is different from Matlab, in which `start:step:stop` will include
both the `start` and the `stop` .
